Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Static resources can be served from a local directory by installing an additional route in the Vert.x router.
ja_jp: Vert.xルーターに追加ルートをインストールすることで、静的リソースをローカルディレクトリから提供できます。

source: Static tenant configuration resolution
ja_jp: 静的テナント設定の解決

source: Static tenant resolution using one of these options: custom `TenantResolver`, configured tenant paths, and defaulting to the last request path segment as a tenant id.
ja_jp: 静的テナント解決は、カスタム `TenantResolver`、設定されたテナントパス、およびテナント ID として最後のリクエストパスセグメントをデフォルト設定するオプションのいずれかを使用します。

source: Static value
ja_jp: 静的値

source: Statically importing the methods in the Wiremock package makes it easier to read the test.
ja_jp: Wiremock パッケージのメソッドを静的にインポートすることで、テストが読みやすくなります。

source: Statistic information is presented via a browser-based user interface, shown in Figure 2 above. Team statistics are accumulated as a percentage of wins by heroes vs. villains. Winner statistics are accumulated by the number of wins for each hero or villain, retaining the top 10 winners. The statistics are pushed to the UI over WebSockets.
ja_jp: 統計情報は、上の図2に示すように、ブラウザベースのユーザーインターフェースで表示されます。チームの統計は、ヒーローとヴィランの勝利数の割合で表示されます。勝者の統計は、ヒーローとヴィランのそれぞれの勝利数で蓄積され、上位10人の勝利数が保持されます。統計情報は、WebSocketを介してUIにプッシュされます。

source: Status
ja_jp: ステータス

source: Stay tuned for the latest info about Quarkiverse in the link:https://github.com/quarkiverse/quarkiverse/wiki[Quarkiverse Wiki]
ja_jp: https://github.com/quarkiverse/quarkiverse/wiki[Quarkiverse Wiki]では、Quarkiverseの最新情報をご確認いただけます。

source: Step 1 - Enable Monitoring for user-defined projects in OpenShift
ja_jp: ステップ1 - OpenShiftでユーザー定義のプロジェクトのモニタリングを有効化

source: Step 1 - Generate the Quarkus Project
ja_jp: ステップ1 - Quarkusプロジェクトの生成

source: Step 1 - Generate your project
ja_jp: ステップ 1 - プロジェクトの生成

source: Step 1: Analyze Factors:
ja_jp: ステップ1: 要因分析:

source: Step 1: Create the application:
ja_jp: ステップ1：アプリケーションの作成

source: Step 1: Exclusion of `protoc`
ja_jp: ステップ 1: `protoc` を除外する

source: Step 1: Unauthenticated user accesses an endpoint and is redirected to OIDC provider
ja_jp: 手順 1: 認証されていないユーザーがエンドポイントにアクセスし、OIDC プロバイダーにリダイレクトされます。

source: Step 2 - Add the Quarkus REST Endpoint
ja_jp: ステップ2 - Quarkus RESTエンドポイントの追加

source: Step 2 - What are we going to exchange?
ja_jp: ステップ2 - 何を交換するか?

source: Step 2: Add LRA support
ja_jp: ステップ2：LRAサポートの追加

source: Step 2: Passing the `quarkus.grpc.protoc-path` property:
ja_jp: ステップ 2: `quarkus.grpc.protoc-path` プロパティーを渡す

source: Step 2: Synthesize Options:
ja_jp: ステップ2: オプションの統合:

source: Step 2: The user is redirected back to the endpoint
ja_jp: 手順 2: ユーザーはエンドポイントにリダイレクトされます。

source: Step 3 - Configure the application
ja_jp: ステップ3 - アプリケーションの設定

source: Step 3 - Generate the React Project
ja_jp: ステップ3 - Reactプロジェクトの生成

source: Step 3: Authenticated user accesses the secured path using the session cookie
ja_jp: ステップ 3: 認証されたユーザーがセッション Cookie を使用して保護されたパスにアクセスする

source: Step 3: Extending the LRA across two service methods
ja_jp: ステップ3：LRAを2つのサービス方式に拡張

source: Step 3: Recommendation:
ja_jp: ステップ3: 推奨:

source: Step 4 - Create a Patternfly Table Component to Populate with our Data
ja_jp: ステップ4 - Patternflyのテーブルコンポーネントを作成して、データで埋める

source: Step 4 - Publishing movies to AMQP
ja_jp: ステップ4 - AMQPへのムービーの公開

source: Step 4 - Publishing movies to Kafka
ja_jp: ステップ 4 - Kafkaにムービーを公開する

source: Step 4: Start an LRA in one microservice and end it in a different microservice
ja_jp: ステップ4：あるマイクロサービスでLRAを開始し、別のマイクロサービスで終了する

source: Step 5 - Consuming movies
ja_jp: ステップ5 - 映画を消費する

source: Step 5 - Prepare our Project for Production Build
ja_jp: ステップ5 - プロジェクトの本番ビルドへの準備

source: Step 6 - Sending movies from a REST endpoint
ja_jp: ステップ6 - RESTエンドポイントからのムービーの送信

source: Step 7 - Let's get this running!
ja_jp: ステップ7 - これを実行してみましょう!

source: Step 8 - Native packaging
ja_jp: ステップ8 - ネイティブパッケージ

source: Step <span class="step-no">1</span>
ja_jp: ステップ <span class="step-no">1</span>

source: Step <span class="step-no">2</span>
ja_jp: ステップ <span class="step-no">2</span>

source: Step <span class="step-no">3</span>
ja_jp: ステップ <span class="step-no">3</span>

source: Step <span class="step-no">4</span>
ja_jp: ステップ <span class="step-no">4</span>

source: Step Up Authentication
ja_jp: ステップアップ認証

source: Step-by-step guides to covering key tasks, real world operations and common problems.
ja_jp: 主要なタスク、実際の操作、一般的な問題をカバーするためのステップバイステップのガイド。

source: Stereotypes
ja_jp: ステレオタイプ

source: Still tools that do security scans are not smart enough to discern between a transitive dependency and what actually ends up bundled and/or configured in your application.
ja_jp: セキュリティスキャンを行うツールは、推移的依存関係と、実際にアプリケーションにバンドルされたり設定されたりするものを区別するほど賢くはありません。

source: Stop Quarkus and run `docker ps` again. You should see nothing running (it may take a few moments for containers to shut down). Quarkus will automatically stop the container when your application stops.
ja_jp: Quarkus を停止し、再度 `docker ps` を実行します。 何も実行されていないはずです (コンテナーがシャットダウンするまでに数分かかる場合があります)。 アプリケーションが停止すると、Quarkus はコンテナーを自動的に停止します。

source: Stop all other running environments to free up the ports and run:
ja_jp: 他の稼働中の環境をすべて停止してポートを空け、実行します。

source: Stop with the words! I want my flamegraphs!
ja_jp: 「言葉はいいから！フレームグラフを見せてくれ！」

source: Storage (Manage local browser storage used in Dev UI)
ja_jp: ストレージ (Dev UI で使用されるローカルブラウザストレージの管理)

source: Storage of JIT-compiled code in the AOT cache, which would further reduce warmup time.
ja_jp: JIT コンパイルされたコードを AOT キャッシュに保存することで、ウォームアップ時間がさらに短縮されます。

source: Store `Timeslot`, `Room`, and `Lesson` in the database with xref:hibernate-orm-panache.adoc[Hibernate and Panache].
ja_jp: `Timeslot`、 `Room`、 `Lesson` を xref:hibernate-orm-panache.adoc[Hibernate および Panache] を使用してデータベースに保存します。

source: Store a counter
ja_jp: カウンターの格納

source: Store authorization code flow tokens
ja_jp: 認可コードフローのトークンの保存

source: Store binary data
ja_jp: バイナリーデータの格納

source: Store secrets in a Keystore
ja_jp: キーストアへのシークレットの保存

source: Store secrets in an environment properties file
ja_jp: 環境プロパティファイルへのシークレットの保存

source: Store the `WebClient`, so we will be able to use it in our HTTP endpoint
ja_jp: HTTP エンドポイントで使用できるように、 `WebClient` を保存します。

source: Store the managed Vert.x instance into a field.
ja_jp: マネージドVert.xインスタンスをフィールドに格納します。

source: Store the payload in the database using Hibernate Reactive with Panache,
ja_jp: Hibernate Reactive with Panache を使用して、ペイロードをデータベースに保存します。

source: Store the secret in the `.env` file in the project root directory.
ja_jp: プロジェクト・ルート・ディレクトリの `.env` ファイルにシークレットを保存します。

source: Store your credentials securely in HashiCorp Vault
ja_jp: HashiCorp Vault にクレデンシャルを安全に保存する

source: Stores the currently opened web sockets
ja_jp: 現在開いているWebSocketを格納します

source: Storing a counter
ja_jp: カウンターの格納

source: Storing binary data
ja_jp: バイナリーデータの格納

source: Storing our WebAuthn credentials
ja_jp: WebAuthn 認証情報の保存

source: Storing roles in another entity
ja_jp: 別のエンティティーにロールを格納する

source: Stork Reference
ja_jp: Stork リファレンス

source: Stork Reference Guide
ja_jp: Stork リファレンスガイド

source: Stork and Quarkus
ja_jp: StorkとQuarkus

source: Stork configuration
ja_jp: Stork設定

source: Stork handles both discovery and selection. However, it does not handle the communication with the service but only provides a service instance. The various integrations in Quarkus extract the location of the service from that service instance.
ja_jp: Storkはディスカバリーとセレクションの両方を扱います。しかし、サービスとの通信は処理せず、サービスインスタンスを提供するだけです。Quarkusの様々な統合機能は、そのサービスインスタンスからサービスの場所を抽出します。

source: Stork is extensible, and you can implement your own service discovery mechanism.
ja_jp: Storkは拡張性があり、独自のサービスディスカバリーメカニズムを実装することができます。

source: Stork is extensible, and you can implement your own service selection (load-balancer) mechanism.
ja_jp: Storkは拡張性があり、独自のサービス選択（ロードバランサー）メカニズムを実装することができます。

source: Stork is extensible. You can implement your own service discovery or service selection provider.
ja_jp: Storkは拡張可能です。独自のサービスディスカバリプロバイダーやサービスセレクションプロバイダーを実装することができます。

source: Stork is not limited to Consul and integrates with other service discovery mechanisms.
ja_jp: StorkはConsulに限らず、他のサービスディスカバリーメカニズムとも統合されています。

source: Stork is not limited to Kubernetes and integrates with other service discovery mechanisms.
ja_jp: Stork は Kubernetes に限定されず、他のサービス検出メカニズムと統合されます。

source: Stork looks for the Kubernetes Service with the given name (`my-service` in the previous example) in the specified namespace. Instead of using the Kubernetes Service IP directly and let Kubernetes handle the selection and balancing, Stork inspects the service and retrieves the list of pods providing the service. Then, it can select the instance.
ja_jp: Storkは、指定された名前（前の例では `my-service` ）のKubernetes Serviceを指定された名前空間で探します。StorkはKubernetes ServiceのIPを直接使用し、選択とバランシングをKubernetesに任せるのではなく、サービスを検査し、サービスを提供しているポッドのリストを取得します。そして、インスタンスを選択することができます。

source: Stork metrics are automatically enabled when the application also uses the xref:telemetry-micrometer.adoc[`quarkus-micrometer`] extension.
ja_jp: Stork のメトリクスは、アプリケーションが xref:telemetry-micrometer.adoc[quarkus-micrometer] エクステンションも利用している場合に自動的に有効化されます。

source: Stork provides a service discovery support for Kubernetes, which goes beyond what Kubernetes provides by default. It looks for all the pods backing up a Kubernetes service, but instead of applying a round-robin (as Kubernetes would do), it gives you the option to select the pod using a Stork load-balancer.
ja_jp: Storkは、Kubernetesがデフォルトで提供しているものを超える、Kubernetesのサービスディスカバリーサポートを提供します。これは、KubernetesのサービスをバックアップしているすべてのPodを探しますが、Kubernetesのようにラウンドロビンを適用するのではなく、Storkのロードバランサーを使用してポッドを選択するオプションを提供します。

source: Strava does not enforce that the redirect (callback) URI which is provided as an authorization code flow parameter is equal to the URI registered in the Strava application because it only requires configuring `ApplicationCallbackDomain`. For example, if `ApplicationCallbackDomain` is set to `www.my-strava-example.com`, Strava will accept redirect URIs such as `www.my-strava-example.com/a`, `www.my-strava-example.com/path/a`, which is not recommended by OAuth2 best security practices, see link:https://datatracker.ietf.org/doc/html/draft-ietf-oauth-security-topics#name-insufficient-redirect-uri-v[Insufficient redirect_uri validation] for more information. Therefore you must configure a redirect path when working with the Strava provider and Quarkus will enforce that the current request path matches the configured `quarkus.oidc.authentication.redirect-path` value before completing the authorization code flow. See the <<exact_redirect_uri_match>> for more information.
ja_jp: Strava では、認可コードフローパラメーターとして提供されるリダイレクト (コールバック) URI と、Strava アプリケーションに登録されている URI が一致するよう強制されません。これは、 `ApplicationCallbackDomain` を設定するだけでよいためです。たとえば、 `ApplicationCallbackDomain` が `www.my-strava-example.com` に設定されている場合、Strava では `www.my-strava-example.com/a`、 `www.my-strava-example.com/path/a` などのリダイレクト URI を使用できますが、これは OAuth2 のベストセキュリティープラクティスでは推奨されていません。詳細は、link:https://datatracker.ietf.org/doc/html/draft-ietf-oauth-security-topics#name-insufficient-redirect-uri-v[不十分な redirect_uri 検証] を参照してください。 したがって、Strava プロバイダーを使用する場合はリダイレクトパスを設定する必要があり、Quarkus は認可コードフローを完了する前に、現在のリクエストパスが設定された`quarkus.oidc.authentication.redirect-path`値と一致することを強制します。詳細は、<<exact_redirect_uri_match>> を参照してください。

source: Stream Processing
ja_jp: ストリーム処理

source: Stream processing
ja_jp: ストリーム処理

source: Stream-processing methods are executed at startup, then each message is dispatched on event loop.
ja_jp: ストリーム処理メソッドは起動時に実行され、各メッセージはイベントループにディスパッチされます。

source: StreamNative Cloud is a fully managed Pulsar-as-a-Service available in different deployment options, whether it is fully-hosted, on a public cloud but managed by StreamNative or self-managed on Kubernetes.
ja_jp: StreamNative Cloud は、フルマネージドの Pulsar-as-a-Service です。完全ホスト型、パブリッククラウド上で StreamNative によって管理する方式、Kubernetes 上で自己管理する方式など、さまざまなデプロイ方法で利用できます。

source: Streaming JSON Array items
ja_jp: JSON 配列アイテムのストリーミング

source: Streaming Kafka topics as server-sent events
ja_jp: サーバー送信イベントとしての Kafka トピックのストリーミング

source: Streaming a Kafka topic as server-sent events (SSE) is straightforward:
ja_jp: Kafka トピックをサーバー送信イベント (SSE) としてストリーミングするのは簡単です。

source: Streaming data
ja_jp: ストリーミングデータ

source: Streaming support
ja_jp: ストリーミングサポート

source: Streamlined code for the 80% common usages, flexible for the 20%
ja_jp: 80%の一般的な用途には合理的なコード、20%の用途には柔軟なコード

source: Streams
ja_jp: ストリーム

source: Streams are identified using `platformKey:streamId` syntax. A specific stream can be specified using `-S platformKey:streamId`. When specifying a stream, empty segments will be replaced with _discovered_ defaults, based on stream resource resolution rules.
ja_jp: ストリームは、 `platformKey:streamId` 構文を使用して識別されます。特定のストリームを指定するには `-S platformKey:streamId` を使用します。ストリームを指定する際、空のセグメントはストリームリソースの解決ルールに 基づき、 _発見された_ デフォルトに置き換えられます。

source: Strict Mode
ja_jp: ストリクトモード

source: Strict Rendering
ja_jp: strict レンダリング

source: Strict authorization code flow support
ja_jp: 厳格な認可コードフローのサポート

source: Strict authorization code flow support implies enforcing that the claims such as issuer, audience and other key claims are set to specific values or available.
ja_jp: 厳格な認可コードフローのサポートとは、issuer、audience、およびその他の主要なクレームが特定の値に設定されているか、または利用可能であることを強制することを意味します。

source: Strict bearer access token support
ja_jp: 厳格なベアラーアクセストークンのサポート

source: Strict bearer access token support implies enforcing that the claims such as issuer, audience and other key claims are set to specific values or available.
ja_jp: 厳格なベアラーアクセストークンのサポートとは、issuer、audience、およびその他の主要なクレームが特定の値に設定されているか、または利用可能であることを強制することを意味します。

source: Strict rendering is enabled by default. However, you can disable this functionality via `io.quarkus.qute.EngineBuilder.strictRendering(boolean)`.
ja_jp: strict レンダリングはデフォルトで有効になっています。しかし、`io.quarkus.qute.EngineBuilder.strictRendering(boolean)` によって、この機能を無効にすることができます。

source: Strimzi provides container images and Operators for running Apache Kafka on Kubernetes. While Strimzi is optimized for Kubernetes, the images work perfectly in classic container environments. Strimzi container images run "genuine" Kafka broker on JVM, which is slower to start.
ja_jp: Strimziは、Kubernetes上でApache Kafkaを動作させるためのコンテナイメージとOperatorを提供します。StrimziはKubernetesに最適化されていますが、イメージは従来のコンテナ環境でも完全に動作します。Strimziのコンテナイメージは、JVM上で “純正” のKafkaブローカーを動作させますが、起動が遅くなっています。

source: String
ja_jp: 文字列

source: String (which will be used as a literal, no Spring MVC view support is provided)
ja_jp: 文字列 (リテラルとして使用されます。Spring MVC ビューのサポートはありません)

source: String representing a file system path using `/` as a path element
ja_jp: パス要素として `/` を使用してファイルシステムパスを表す文字列

source: String value with `content_type` set to `text/plain`
ja_jp: `content_type` が `text/plain` に設定された文字列の値

source: String-Based Qualifiers
ja_jp: 文字列ベースの修飾子

source: Structure of the extension
ja_jp: エクステンションの構造

source: Structures the application for optimal AOT class loading
ja_jp: 最適な AOT クラスロードのためにアプリケーションを構成する

source: Stubs and Injection
ja_jp: スタブとインジェクション

source: Style
ja_jp: スタイル

source: Styles can reference globally defined CSS variables to make sure your page renders correctly, especially when switching between light and dark mode. You can find all CSS variables in the Vaadin documentation (https://vaadin.com/docs/latest/styling/lumo/lumo-style-properties/color[Color], https://vaadin.com/docs/latest/styling/lumo/lumo-style-properties/size-space[Sizing and Spacing], etc.)
ja_jp: スタイルは、グローバルに定義された CSS 変数を参照して、特にライトモードとダークモードの切り替え時にページが正しくレンダリングされるようにすることができます。すべての CSS 変数は、Vaadin のドキュメント ((https://vaadin.com/docs/latest/styling/lumo/lumo-style-properties/color[カラー]、 https://vaadin.com/docs/latest/styling/lumo/lumo-style-properties/size-space[・サイズと間隔]など) で確認できます。

source: Styling
ja_jp: スタイリング

source: Stylish API
ja_jp: スタイリッシュAPI

source: Sub-websockets endpoints
ja_jp: sub-websocket エンドポイント

source: Sub-websockets inherit access to the path parameters declared in the `@WebSocket` annotation of both the enclosing and nested classes. The `consumePrimary` method within the enclosing class can access the `version` parameter in the following example. Meanwhile, the `consumeNested` method within the nested class can access both `version` and `id` parameters:
ja_jp: sub-websocket は、外側のクラスとネストされたクラスの両方の `@WebSocket` アノテーションで宣言されたパスパラメーターへのアクセスを継承します。 次の例では、外側のクラス内の `consumePrimary` メソッドは `version` パラメーターにアクセスできます。 一方、ネストされたクラス内の `consumeNested` メソッドは、 `version` パラメーターと `id` パラメーターの両方にアクセスできます。

source: Subclasses never inherit the metadata of a `@Scheduled` method declared on a superclass. In the following example, the `everySecond()` method is only invoked upon the instance of `Jobs`.
ja_jp: サブクラスは、スーパークラスで宣言された `@Scheduled` メソッドのメタデータを継承することはありません。次の例では、 `everySecond()` メソッドは `Jobs` のインスタンスに対してのみ呼び出されます。

source: Subject (`sub`) cliam value
ja_jp: サブジェクト (`sub`) クレーム値

source: Subject access control example
ja_jp: サブジェクトアクセス制御の例

source: SubjectExposingResource Example
ja_jp: SubjectExposingResourceの例

source: SubjectExposingResource example
ja_jp: SubjectExposingResourceの例

source: Submit your proposed changes to the core Quarkus docs by {gh-pull-requests-fork}[creating a pull request] against the `main` branch of the Quarkus repository from your own {gh-about-forks}[repository fork].
ja_jp: Quarkus リポジトリーの `main` ブランチに対して、{gh-pull-requests-fork}[プルリクエストの作成] を行い、自身の {gh-about-forks}[リポジトリーのフォーク] から Quarkus のコアドキュメントに変更案を提出します。

source: Submitting the reindexing request will trigger indexing in the background. Mass indexing progress will appear in the application logs. For testing purposes, it might be useful to know when the indexing finished. Adding `wait_for=finished` query parameter to the URL will result in the management endpoint returning a chunked response that will report when the indexing starts and then when it is finished.
ja_jp: インデックスの再作成要求を送信すると、バックグラウンドでインデックスの作成がトリガーされます。インデックスの一括作成の進行状況はアプリケーションログに表示されます。 テスト目的の場合、インデックスの作成がいつ終了したかを知ることは役に立つかもしれません。URL に `wait_for=finished` クエリーパラメーターを追加すると、 管理エンドポイントが、インデックス作成の開始時と終了時を報告するチャンク化された応答を返します。

source: Submodule `bar` depends on `foo` and extends its functionality. The `foo/deployment` submodule contains `QuarkusUnitTest`s that test classes from `foo/runtime`. The `bar/deployment` submodule contains `QuarkusUnitTest`s that test classes from both `bar/runtime` and `foo/runtime`.
ja_jp: サブモジュール `bar` は `foo` に依存し、その機能を拡張します。`foo/deployment` サブモジュールには、`foo/runtime` のクラスをテストする `QuarkusUnitTest` が含まれています。`bar/deployment` サブモジュールには、`bar/runtime` と `foo/runtime` の両方のクラスをテストする `QuarkusUnitTest` が含まれています。

source: Subpath permissions always win against the root path permissions as explained above in the `deny1` versus `permit1` permission example. Here is another example showing a subpath permission allowing a public resource access with the root path permission requiring the authorization:
ja_jp: サブパス パーミッションは、上述の `deny1` 対 `permit1` パーミッションの例で説明したように、ルートパス パーミッションに対して常に勝利します。以下は、サブパス権限で公開リソースへのアクセスを許可し、ルートパス権限で認可を要求する例です。 :

source: Subpath permissions precede root path permissions, as the `deny1` versus `permit1` permission example previously illustrated.
ja_jp: 前述の `deny1` 権限と `permit1` 権限の例で示したように、サブパスの権限がルートパスの権限よりも優先されます。

source: Subscribe to task updates via push notifications
ja_jp: プッシュ通知によるタスク更新の購読

source: Subscribe to the <a href="{{site.baseurl}}/newsletter">monthly newsletter</a> to have choice Quarkus content from across our community delivered to your inbox.
ja_jp: <a href="{{site.baseurl}}/newsletter">月刊ニュースレター</a>を購読すると、コミュニティ内の選りすぐりのQuarkusコンテンツが受信箱に配信されます。

source: Subscribing to a Uni or a Multi is essential, as without it, the operation is never executed. In Quarkus some extensions deal with the subscription for you. For example, in Quarkus REST your HTTP methods can return a Uni or a Multi, and Quarkus REST handles the subscription.
ja_jp: UniまたはMultiへのサブスクライブは不可欠です。無しには操作を実行できません。 Quarkusでは、サブスクリプションを処理するエクステンションがあります。 例えば、Quarkus RESTでは、HTTPメソッドがUniまたはMultiを返すことができ、Quarkus RESTがサブスクリプションを処理します。

source: Subscribing to a Uni or a Multi is essential, as without it, the operation is never executed. In Quarkus some extensions deal with the subscription for you. For example, in RESTEasy Reactive your HTTP methods can return a Uni or a Multi, and RESTEasy Reactive handles the subscription.
ja_jp: UniやMultiへのサブスクリプションは必須であり、それがなければ操作は実行されません。Quarkusでは、いくつかのエクステンションがサブスクリプションを処理してくれます。たとえば、RESTEasy Reactiveでは、HTTPメソッドでUniやMultiを返すことができ、RESTEasy Reactiveが購読を処理します。

source: Subscribing to the `temperatures-aggregated` topic is a great way to react to any new temperature values. It's a bit wasteful though if you're just interested in the latest aggregated value for a given weather station. This is where Kafka Streams interactive queries shine: they let you directly query the underlying state store of the pipeline for the value associated to a given key. By exposing a simple REST endpoint which queries the state store, the latest aggregation result can be retrieved without having to subscribe to any Kafka topic.
ja_jp: `temperatures-aggregated` のトピックを購読することは、新しい気温の値に反応するための素晴らしい方法です。しかし、特定の気象観測所の最新の集計値だけに興味があるのであれば、少しもったいないです。そこで、Kafka Streams の対話型クエリが威力を発揮します。ステートストアをクエリするシンプルな REST エンドポイントを公開することで、Kafka トピックを購読しなくても最新の集計結果を取得することができます。

source: Subscription is currently still considered experimental.
ja_jp: サブスクリプションは現在、まだ実験的なものとされています。

source: Subscription name
ja_jp: サブスクリプション名

source: Subscription type. + Four subscription types are available: + * Exclusive + * Failover + * Shared + * Key_Shared
ja_jp: サブスクリプションタイプ。 4つのサブスクリプションタイプがあります: + * Exclusive + * Failover + * Shared + * Key_Shared

source: Subscriptions
ja_jp: サブスクリプション

source: Subscriptions allow you to subscribe to a query. It allows you to receive events and is using web sockets. See the https://github.com/enisdenjo/graphql-ws/blob/master/PROTOCOL.md[GraphQL over WebSocket Protocol] spec for more details.
ja_jp: サブスクリプションは、クエリーを購読することができます。イベントを受信することができ、web socketを使用しています。詳しくは link:https://github.com/enisdenjo/graphql-ws/blob/master/PROTOCOL.md[GraphQL over WebSocket Protocol] 仕様をご覧ください。

source: Subscriptions allows you to subscribe to a query. It allows you to receive events.
ja_jp: サブスクリプションでは、クエリを購読することができます。イベントを受信することができます。

source: Substitution of XmlConfig/XmlData Classes Example
ja_jp: Substitution of XmlConfig/XmlData クラスの例

source: Substrate VM native
ja_jp: Substrate VM ネイティブ

source: Substrate VM:: non-preferred. Exclude.
ja_jp: Substrate VM:: 非推奨。除外。

source: Success! We now have:
ja_jp: 成功です! これで以下が得られます:

source: Success! You now have the following:
ja_jp: 正常に完了しました。これで次のようになりました。

source: Such a callback implementation has to be registered as a "service provider" as defined by `java.util.ServiceLoader`.
ja_jp: このようなコールバックの実装は、 `java.util.ServiceLoader` で定義されている「サービスプロバイダ」として登録する必要があります。

source: Such a multi-stage build can be achieved as follows:
ja_jp: このような多段階を用いたビルドは、次のように実現できます:

source: Such a program polls a batch of records, processes them, and then polls the next set. While calling the `poll` method, the consumer periodically commits the last offset of the previous batches transparently.
ja_jp: このようなプログラムは、レコードのバッチをポーリングして処理し、次のセットをポーリングします。 `poll` メソッドを呼び出している間、コンシューマーは定期的に前のバッチの最後のオフセットを透過的にコミットします。

source: Such a response filter will also be called for <<exception-mapping, handled>> exceptions.
ja_jp: このような応答フィルターは、<<exception-mapping, handled>> 例外でも呼び出されます。
